dominiczy/satelliteplatform/processors/msp430sctlm/msp430_isa.H
/******************************************************
 * Instruction Set Architecture header file.          *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef _MSP430_ISA_H
#define _MSP430_ISA_H

#include "msp430_parms.H"
#include "ac_instr.H"
#include "ac_decoder_rt.H"
#include "ac_instr_info.H"
#include "msp430_arch.H"
#include "msp430_arch_ref.H"
#include "msp430_syscall.H"

namespace msp430_parms
{
class msp430_isa: public msp430_arch_ref {
private:
typedef ac_instr<AC_DEC_FIELD_NUMBER> ac_instr_t;

public:
  static ac_dec_field fields[AC_DEC_FIELD_NUMBER];
  static ac_dec_format formats[AC_DEC_FORMAT_NUMBER];
  static ac_dec_list dec_list[AC_DEC_LIST_NUMBER];
  static ac_dec_instr instructions[AC_DEC_INSTR_NUMBER];
  static const ac_instr_info instr_table[AC_DEC_INSTR_NUMBER + 1];

  ac_decoder_full* decoder;

  msp430_syscall syscall;
  int cur_instr_id;

  //!Constructor.
  msp430_isa(msp430_arch& ref) : msp430_arch_ref(ref) , syscall(ref) {
    //!Building Decoder.
    decoder = ac_decoder_full::CreateDecoder(msp430_isa::formats, msp430_isa::instructions, &ref);
  }

  inline const char* get_name() { return instr_table[cur_instr_id].ac_instr_name; }
  inline const char* get_mnemonic() { return instr_table[cur_instr_id].ac_instr_mnemonic; }
  inline unsigned get_size() { return instr_table[cur_instr_id].ac_instr_size; };
  inline unsigned get_cycles() { return instr_table[cur_instr_id].ac_instr_cycles; };
  inline unsigned get_min_latency() { return instr_table[cur_instr_id].ac_instr_min_latency; };
  inline unsigned get_max_latency() { return instr_table[cur_instr_id].ac_instr_max_latency; };

  void _behavior_instruction();

  void _behavior_begin();
  void _behavior_end();

  void _behavior_msp430_Double_48(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void _behavior_msp430_Double_32(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void _behavior_msp430_Double(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void _behavior_msp430_Single_32(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void _behavior_msp430_Single(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void _behavior_msp430_Jump(unsigned int opc, unsigned int c, int offset);

  void behavior_mov_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_mov_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_add_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_add_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_addc_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_addc_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_and_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_and_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bic_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bic_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bis_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bis_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bit_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bit_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_cmp_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_cmp_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_dadd_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_dadd_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_sub_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_sub_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_subc_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_subc_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_xor_48idm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_xor_48imm(unsigned int odst, unsigned int osrc, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_mov_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_mov_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_mov_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_mov_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_mov_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_add_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_add_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_add_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_add_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_add_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_addc_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_addc_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_addc_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_addc_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_addc_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_and_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_and_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_and_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_and_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_and_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bic_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bic_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bic_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bic_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bic_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bis_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bis_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bis_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bis_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bis_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bit_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bit_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bit_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bit_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bit_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_cmp_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_cmp_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_cmp_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_cmp_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_cmp_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_dadd_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_dadd_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_dadd_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_dadd_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_dadd_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_sub_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_sub_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_sub_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_sub_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_sub_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_subc_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_subc_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_subc_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_subc_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_subc_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_xor_32idst(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_xor_32isrc(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_xor_32imm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_xor_32iaim(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_xor_32irm(unsigned int oset, unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_mov_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_mov_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_mov_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_add_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_add_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_add_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_addc_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_addc_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_addc_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_and_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_and_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_and_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bic_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bic_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bic_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bis_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bis_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bis_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bit_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bit_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_bit_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_cmp_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_cmp_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_cmp_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_dadd_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_dadd_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_dadd_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_sub_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_sub_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_sub_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_subc_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_subc_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_subc_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_xor_16rm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_xor_16irm(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_xor_16iaim(unsigned int op, unsigned int sreg, unsigned int ad, unsigned int bw, unsigned int as, unsigned int dreg);
  void behavior_rrc_32sm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rrc_32am(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rrc_32imm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rrc_32im(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rra_32sm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rra_32am(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rra_32imm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rra_32im(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_swpb_32sm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_swpb_32am(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_swpb_32imm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_swpb_32im(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_sxt_32sm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_sxt_32am(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_sxt_32imm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_sxt_32im(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_push_32sm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_push_32am(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_push_32imm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_push_32im(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_call_32sm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
