dominiczy/satelliteplatform/processors/msp430sctlm/msp430_isa.H
  void behavior_call_32am(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_call_32imm(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_call_32im(unsigned int oset, unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rrc_16rm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rrc_16irm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rrc_16iaim(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rra_16rm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rra_16irm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_rra_16iaim(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_swpb_16rm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_swpb_16irm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_swpb_16iaim(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_sxt_16rm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_sxt_16irm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_sxt_16iaim(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_push_16rm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_push_16irm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_push_16iaim(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_call_16rm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_call_16irm(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_call_16iaim(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_reti(unsigned int cnt, unsigned int op, unsigned int bw, unsigned int as, unsigned int sreg);
  void behavior_jne(unsigned int opc, unsigned int c, int offset);
  void behavior_jeq(unsigned int opc, unsigned int c, int offset);
  void behavior_jnc(unsigned int opc, unsigned int c, int offset);
  void behavior_jc(unsigned int opc, unsigned int c, int offset);
  void behavior_jn(unsigned int opc, unsigned int c, int offset);
  void behavior_jge(unsigned int opc, unsigned int c, int offset);
  void behavior_jl(unsigned int opc, unsigned int c, int offset);
  void behavior_jmp(unsigned int opc, unsigned int c, int offset);

};
}



#endif //_MSP430_ISA_H

